{
  "fr": {
    "welcome": "Bienvenue sur notre site !",
    "description": "Ceci est un exemple de site multilingue.",
    "button": "Cliquez ici",
    "home_title": "Page d'accueil",
    "carousel_title": [
      "Développement Web Full Stack",
      "Analyse et Modélisation de Données",
      "Développement Front-End Dynamique"
    ],
    "carousel_slogan": [
      "De l'idée à l'interface : Créez des applications web dynamiques et intégrées.",
      "Transformez les données en décisions : Expertise Python pour des insights puissants",
      "Des interfaces réactives et engageantes : Le front-end qui captive et convertit."
    ],
    "carousel_button": "En savoir plus",
    "carousel_learn_more": [
      "Réalisez vos visions numériques en développant des applications web complètes et fonctionnelles...",
      "Exploitez la puissance de vos données grâce à une expertise avancée en Python pour l'analyse et la modélisation...",
      "Concevez des expériences utilisateur exceptionnelles grâce à une maîtrise approfondie des technologies front-end..."
    ],
    "skills_title1": "Programmation en Python et Analyse de Données",
    "skills_title1_paragraph": "Grâce à ma maîtrise des bibliothèques Pandas, NumPy, Matplotlib, et scikit-learn, je suis en mesure de manipuler, analyser et modéliser des ensembles de données complexes afin d'en extraire des insights précieux. De plus, je suis capable de créer une large variété de graphiques de données, facilitant ainsi l'interprétation des résultats, à l'aide d'outils tels que Matplotlib et Seaborn. Mon expertise inclut également la conception de tableaux de bord interactifs via Tableau et Power BI, permettant une prise de décision éclairée basée sur les données.",
    "skills_title2": "Base de données",
    "skills_title2_paragraph": "Je possède une solide expérience dans la conception, l’interrogation et la gestion de bases de données relationnelles avec SQL, ainsi qu'une capacité à optimiser les requêtes pour une manipulation efficace des données. Par ailleurs, je maîtrise l’utilisation des bases de données NoSQL, notamment MongoDB, ce qui me permet de gérer des données non structurées ou semi-structurées et de développer des applications nécessitant une flexibilité accrue.",
    "skills_title3": "Développement Full Stack",
    "skills_title3_paragraph": "Compétence en développement Full Stack, avec une capacité à concevoir et implémenter à la fois le front-end et le back-end d’applications web. Expérience dans l’intégration de bases de données, la gestion de serveurs, et la création d’interfaces utilisateur intuitives.",
    "skills_title4": "Design UX/UI",
    "skills_title4_paragraph": "Capacité à concevoir des interfaces utilisateur ergonomiques et intuitives, en appliquant les principes fondamentaux de l’expérience utilisateur pour garantir une interaction fluide et agréable.",
    "title-projects": "Exemples de projets personnels",
    "project1-title": "Projet 1",
    "project1-description": "Description du premier projet.",
    "project2-title": "Projet 2",
    "project2-description": "Description du deuxième projet.",
    "project3-title": "Projet 3",
    "project3-description": "Description du troisième projet.",
    "nav-home": "Accueil",
    "nav-about": "À propos",
    "nav-skills": "Compétences",
    "nav-projects": "Projets",
    "nav-contact": "Contact",
    "language-selector": "Choisissez la langue",
    "lang-fr": "Français",
    "lang-en": "Anglais",
    "lang-es": "Espagnol",
    "biography_title": "Biographie",
    "intro": "Bonjour, je suis Aloïs Zweber, un professionnel qualifié d'Informatica avec une passion pour l'intégration et la transformation des données.",
    "transition_to_it": "À la fin de 2021, j'ai décidé de me tourner vers le secteur de l'informatique en entamant une formation en développement web. Avec succès, j'ai franchi les étapes de présélection de BeCode, une institution réputée pour ses formations technologiques.",
    "self_learning": "Mon apprentissage s'est déroulé sur une période de 10 mois en immersion complète. Au cours de cette période, j'ai passé 7 mois au sein de BeCode, où j'ai adopté une approche autodidacte, tout en bénéficiant des conseils avisés de plusieurs mentors. Ces mois de dévouement ont considérablement influencé ma compréhension des concepts essentiels du code, renforçant ainsi mon souhait de poursuivre une carrière dans l'IT.",
    "internship_experience": "Pour compléter cette formation enrichissante, j'ai effectué un stage de 3 mois chez Contraste. Cette expérience pratique m'a offert l'opportunité de mettre en œuvre les compétences nouvellement acquises en développement web, consolidant ainsi ma confiance dans ma capacité à concrétiser des designs complexes et dynamiques.",
    "current_focus": "Aujourd'hui, alors que je suis en cours de formation en analyse de données, je canalise mon enthousiasme pour convertir les données en connaissances exploitables. Mon objectif principal est de repérer des schémas et des tendances importants pour éclairer des prises de décision judicieuses. Mon parcours, initialement enraciné dans ma passion pour le développement web, s'est progressivement transformé en une passionnante exploration du monde des données.",
    "contact_invitation": "Je suis enthousiaste à l'idée de contribuer à des projets stimulants et de poursuivre le développement de mes compétences dans le domaine de la data. Si vous partagez mon intérêt pour les projets stimulants liés à la data, je serais ravi de discuter avec vous. Je vous propose de me contacter pour un entretien, où nous pourrons explorer ensemble nos perspectives communes et les passionnantes opportunités de collaboration qui pourraient en découler.",
    "project11_title": "Projet 1",
    "project11_description": "Description du premier projet.",
    "project21_title": "Projet 2",
    "project21_description": "Description du deuxième projet.",
    "project31_title": "Projet 3",
    "project31_description": "Description du troisième projet.",
    "project41_title": "Projet 4",
    "project41_description": "Description du quatrième projet.",
    "project51_title": "Projet 5",
    "project51_description": "Description du cinquième projet.",
    "project61_title": "Projet 6",
    "project61_description": "Description du sixième projet.",
    "contact_section": "Proposition d'entretien",
    "label_firstname": "Prénom :",
    "label_name": "Nom :",
    "label_enterprise": "Entreprise :",
    "label_email": "Email :",
    "label_message": "Message :",
    "button_send": "Envoyer le message",
    "contact_info_title": "Coordonnées",
    "info_email": "Email :",
    "info_phone": "Téléphone :",
    "info_city": "Ville :",
    "ETL": "ETL",
    "ETL_paragraph": "Compétent dans la conception, le développement et la gestion de flux de travail ETL complexes.",
    "data_quality": "Qualité des données",
    "data_quality_paragraph": "Expérimenté dans la mise en œuvre de règles de qualité des données et de stratégies de profilage des données.",
    "MDM": "MDM",
    "MDM_paragraph": "Connaissances en gestion des données de référence et meilleures pratiques de gouvernance des données.",
    "cloud_work": "Travail sur cloud",
    "cloud_work_paragraph": "Adepte de l'utilisation d'Informatica Cloud pour l'intégration et la gestion des données dans le cloud.",
    "SQL": "Gestion de base de données SQL",
    "SQL_paragraph": "Compétent dans l'utilisation des outils avancés d'intégration et de gestion des données dans les bases de données SQL.",
    "NOSQL": "Gestion de base de données NOSQL",
    "NOSQ_paragraph": "Expérimenté dans la mise en œuvre de solutions Informatica pour le traitement et l'analyse de big data avec des bases de données NOSQL."
  },

  "en": {
    "welcome": "Welcome to our website!",
    "description": "This is an example of a multilingual website.",
    "button": "Click here",
    "home_title": "Home page",
    "carousel_title": [
      "Full Stack Web Development",
      "Data Analysis and Modeling",
      "Dynamic Front-End Development"
    ],
    "carousel_slogan": [
      "From idea to interface: Create dynamic and integrated web applications.",
      "Transform data into decisions: Python expertise for powerful insights",
      "Responsive and engaging interfaces: Front-end that captivates and converts."
    ],
    "carousel_button": "Learn More",
    "carousel_learn_more": [
      "Realize your digital visions by developing complete and functional web applications...",
      "Harness the power of your data with advanced Python expertise for analysis and modeling...",
      "Design exceptional user experiences with a deep mastery of front-end technologies..."
    ],
    "skills_title1": "Python Programming and Data Analysis",
    "skills_title1_paragraph": "By my mastery of the Pandas, NumPy, Matplotlib, and scikit-learn libraries, I am able to manipulate, analyze and model complex data sets in order to extract valuable insights. In addition, I'm able to create a wide variety of data graphs, facilitating interpretation of results, using tools such as Matplotlib and Seaborn. My expertise also includes designing interactive dashboards via Tableau and Power BI, enabling informed decision-making based on data.",
    "skills_title2": "Database",
    "skills_title2_paragraph": "I have solid experience in designing, querying and managing relational databases with SQL, as well as the ability to optimize queries for efficient data manipulation. In addition, I am proficient in the use of NoSQL databases, in particular MongoDB, which enables me to manage unstructured or semi-structured data and develop applications requiring increased flexibility.",
    "skills_title3": "Full Stack Development",
    "skills_title3_paragraph": "Proficiency in Full Stack Development, with the ability to design and implement both the front-end and back-end of web applications. Experience in database integration, server management, and creating intuitive user interfaces.",
    "skills_title4": "UX/UI Design",
    "skills_title4_paragraph": "Ability to design ergonomic and intuitive user interfaces by applying fundamental principles of user experience to ensure smooth and pleasant interaction.",
    "title-projects": "Examples of Personal Projects",
    "project1-title": "Project 1",
    "project1-description": "Description of the first project.",
    "project2-title": "Project 2",
    "project2-description": "Description of the second project.",
    "project3-title": "Project 3",
    "project3-description": "Description of the third project.",
    "nav-home": "Home",
    "nav-about": "About",
    "nav-skills": "Skills",
    "nav-projects": "Projects",
    "nav-contact": "Contact",
    "language-selector": "Choose language",
    "lang-fr": "French",
    "lang-en": "English",
    "lang-es": "Spanish",
    "biography_title": "Biography",
    "intro": "Hello, I am Aloïs Zweber, a qualified Informatica professional with a passion for data integration and transformation.",
    "transition_to_it": "At the end of 2021, I decided to shift to the IT sector by starting a web development training. Successfully, I passed the preselection stages of BeCode, a renowned institution for its technological training.",
    "self_learning": "My learning took place over a period of 10 months in full immersion. During this time, I spent 7 months at BeCode, where I took a self-taught approach while benefiting from the valuable advice of several mentors. These months of dedication greatly influenced my understanding of essential coding concepts, thus strengthening my desire to pursue a career in IT.",
    "internship_experience": "To complete this enriching training, I did a 3-month internship at Contraste. This practical experience gave me the opportunity to apply the newly acquired web development skills, thus consolidating my confidence in my ability to bring complex and dynamic designs to fruition.",
    "current_focus": "Today, as I am undergoing training in data analysis, I am channeling my enthusiasm to turn data into actionable insights. My main goal is to spot important patterns and trends to guide informed decision-making. My journey, initially rooted in my passion for web development, has gradually evolved into an exciting exploration of the data world.",
    "contact_invitation": "I am excited to contribute to stimulating projects and continue developing my skills in the data field. If you share my interest in exciting data-related projects, I would be delighted to discuss with you. I invite you to contact me for a meeting, where we can explore our common perspectives and the exciting collaboration opportunities that could arise.",
    "project11_title": "Project 1",
    "project11_description": "Description of the first project.",
    "project21_title": "Project 2",
    "project21_description": "Description of the second project.",
    "project31_title": "Project 3",
    "project31_description": "Description of the third project.",
    "project41_title": "Project 4",
    "project41_description": "Description of the fourth project.",
    "project51_title": "Project 5",
    "project51_description": "Description of the fifth project.",
    "project61_title": "Project 6",
    "project61_description": "Description of the sixth project.",
    "contact_section": "Proposal for Interview",
    "label_firstname": "First Name:",
    "label_name": "Last Name:",
    "label_enterprise": "Company:",
    "label_email": "Email:",
    "label_message": "Message:",
    "button_send": "Send Message",
    "contact_info_title": "Contact Information",
    "info_email": "Email:",
    "info_phone": "Phone:",
    "info_city": "City:",
    "ETL": "ETL",
    "ETL_paragraph": "Skilled in designing, developing, and managing complex ETL workflows.",
    "data_quality": "Data Quality",
    "data_quality_paragraph": "Experienced in implementing data quality rules and data profiling strategies.",
    "MDM": "MDM",
    "MDM_paragraph": "Knowledgeable in master data management and best practices in data governance.",
    "cloud_work": "Cloud Work",
    "cloud_work_paragraph": "Proficient in using Informatica Cloud for data integration and management in the cloud.",
    "SQL": "SQL Database Management",
    "SQL_paragraph": "Skilled in using advanced tools for data integration and management in SQL databases.",
    "NOSQL": "NOSQL Database Management",
    "NOSQ_paragraph": "Experienced in implementing Informatica solutions for big data processing and analysis with NOSQL databases."
  },
  "es": {
    "welcome": "¡Bienvenido a nuestro sitio web!",
    "description": "Este es un ejemplo de un sitio web multilingüe.",
    "button": "Haga clic aquí",
    "home_title": "Página de inicio",
    "carousel_title": [
      "Desarrollo Web Full Stack",
      "Análisis y Modelado de Datos",
      "Desarrollo Front-End Dinámico"
    ],
    "carousel_slogan": [
      "De la idea a la interfaz: Cree aplicaciones web dinámicas e integradas",
      "Transforme datos en decisiones: Experiencia en Python para insights poderosos",
      "Interfaces receptivas y atractivas: Front-end que cautiva y convierte"
    ],
    "carousel_button": "Más información",
    "carousel_learn_more": [
      "Haga realidad sus visiones digitales desarrollando aplicaciones web completas y funcionales...",
      "Aproveche el poder de sus datos con conocimientos avanzados de Python para análisis y modelado...",
      "Diseña experiencias de usuario excepcionales con un profundo dominio de las tecnologías front-end..."
    ],
    "skills_title1": "Programación en Python y análisis de datos",
    "skills_title1_paragraph": "Gracias a mi dominio de las bibliotecas Pandas, NumPy, Matplotlib y scikit-learn, soy capaz de manipular, analizar y modelizar conjuntos de datos complejos para extraer información valiosa. Además, soy capaz de crear una amplia variedad de gráficos de datos, facilitando la interpretación de los resultados, utilizando herramientas como Matplotlib y Seaborn. Mi experiencia también incluye el diseño de cuadros de mando interactivos a través de Tableau y Power BI, lo que permite tomar decisiones informadas basadas en datos.",
    "skills_title2": "Base de datos",
    "skills_title2_paragraph": "Tengo una sólida experiencia en el diseño, consulta y gestión de bases de datos relacionales utilizando SQL, así como la capacidad de optimizar las consultas para una manipulación eficiente de los datos. Además, domino el uso de bases de datos NoSQL, en particular MongoDB, lo que me permite gestionar datos no estructurados o semiestructurados y desarrollar aplicaciones que requieren una mayor flexibilidad.",
    "skills_title3": "Desarrollo Full Stack",
    "skills_title3_paragraph": "Competencia en desarrollo Full Stack, con la capacidad de diseñar e implementar tanto el front-end como el back-end de aplicaciones web. Experiencia en la integración de bases de datos, la gestión de servidores y la creación de interfaces de usuario intuitivas.",
    "skills_title4": "Diseño UX/UI",
    "skills_title4_paragraph": "Capacidad para diseñar interfaces de usuario ergonómicas e intuitivas, aplicando principios fundamentales de la experiencia del usuario para garantizar una interacción fluida y agradable.",
    "title-projects": "Ejemplos de Proyectos Personales",
    "project1-title": "Proyecto 1",
    "project1-description": "Descripción del primer proyecto.",
    "project2-title": "Proyecto 2",
    "project2-description": "Descripción del segundo proyecto.",
    "project3-title": "Proyecto 3",
    "project3-description": "Descripción del tercer proyecto.",
    "nav-home": "Inicio",
    "nav-about": "Sobre mí",
    "nav-skills": "Habilidades",
    "nav-projects": "Proyectos",
    "nav-contact": "Contacto",
    "language-selector": "Elegir idioma",
    "lang-fr": "Francés",
    "lang-en": "Inglés",
    "lang-es": "Español",
    "biography_title": "Biografía",
    "intro": "Hola, soy Aloïs Zweber, un profesional cualificado de Informatica con una pasión por la integración y transformación de datos.",
    "transition_to_it": "A finales de 2021, decidí cambiarme al sector de TI iniciando una formación en desarrollo web. Con éxito, superé las etapas de preselección de BeCode, una institución reconocida por su formación tecnológica.",
    "self_learning": "Mi aprendizaje se llevó a cabo durante un período de 10 meses en inmersión total. Durante este tiempo, pasé 7 meses en BeCode, donde adopté un enfoque autodidacta, beneficiándome de los valiosos consejos de varios mentores. Estos meses de dedicación influyeron considerablemente en mi comprensión de los conceptos esenciales de la codificación, reforzando así mi deseo de seguir una carrera en TI.",
    "internship_experience": "Para completar esta formación enriquecedora, realicé una pasantía de 3 meses en Contraste. Esta experiencia práctica me dio la oportunidad de aplicar las habilidades de desarrollo web recién adquiridas, consolidando mi confianza en mi capacidad para concretar diseños complejos y dinámicos.",
    "current_focus": "Hoy en día, mientras estoy en formación en análisis de datos, canalizo mi entusiasmo para convertir los datos en conocimientos útiles. Mi objetivo principal es identificar patrones y tendencias importantes para guiar la toma de decisiones informadas. Mi trayectoria, inicialmente arraigada en mi pasión por el desarrollo web, se ha transformado gradualmente en una emocionante exploración del mundo de los datos.",
    "contact_invitation": "Estoy entusiasmado por contribuir a proyectos estimulantes y seguir desarrollando mis habilidades en el campo de los datos. Si compartes mi interés en proyectos relacionados con datos, estaría encantado de conversar contigo. Te invito a contactarme para una reunión, donde podremos explorar nuestras perspectivas comunes y las emocionantes oportunidades de colaboración que podrían surgir.",
    "project11_title": "Proyecto 1",
    "project11_description": "Descripción del primer proyecto.",
    "project21_title": "Proyecto 2",
    "project21_description": "Descripción del segundo proyecto.",
    "project31_title": "Proyecto 3",
    "project31_description": "Descripción del tercer proyecto.",
    "project41_title": "Proyecto 4",
    "project41_description": "Descripción del cuarto proyecto.",
    "project51_title": "Proyecto 5",
    "project51_description": "Descripción del quinto proyecto.",
    "project61_title": "Proyecto 6",
    "project61_description": "Descripción del sexto proyecto.",
    "contact_section": "Propuesta de Entrevista",
    "label_firstname": "Nombre:",
    "label_name": "Apellido:",
    "label_enterprise": "Empresa:",
    "label_email": "Correo electrónico:",
    "label_message": "Mensaje:",
    "button_send": "Enviar mensaje",
    "contact_info_title": "Información de Contacto",
    "info_email": "Correo electrónico:",
    "info_phone": "Teléfono:",
    "info_city": "Ciudad:",
    "ETL": "ETL",
    "ETL_paragraph": "Competente en el diseño, desarrollo y gestión de flujos de trabajo ETL complejos.",
    "data_quality": "Calidad de los datos",
    "data_quality_paragraph": "Experimentado en la implementación de reglas de calidad de datos y estrategias de perfilado de datos.",
    "MDM": "MDM",
    "MDM_paragraph": "Conocimientos en gestión de datos maestros y mejores prácticas en gobernanza de datos.",
    "cloud_work": "Trabajo en la nube",
    "cloud_work_paragraph": "Experto en el uso de Informatica Cloud para la integración y gestión de datos en la nube.",
    "SQL": "Gestión de bases de datos SQL",
    "SQL_paragraph": "Competente en el uso de herramientas avanzadas para la integración y gestión de datos en bases de datos SQL.",
    "NOSQL": "Gestión de bases de datos NOSQL",
    "NOSQ_paragraph": "Experimentado en la implementación de soluciones Informatica para el procesamiento y análisis de big data con bases de datos NOSQL."
  }
}
